tap "cube2222/octosql"
tap "discoteq/discoteq"
tap "github/gh"
tap "grusell/vivictpp"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "octave-app/octave-app"
tap "pamburus/tap"
tap "randy3k/r"
tap "saulpw/vd"
tap "segment-integrations/formulae"
tap "slhck/moreutils"
tap "supabase/tap"
tap "svt/avtools"
tap "teamookla/speedtest"
tap "yt-dlp/taps"
# Search tool like grep, but optimized for programmers
brew "ack"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU compiler collection
brew "gcc"
# High performance message passing library
brew "open-mpi"
# Routines to solve large scale eigenvalue problems
brew "arpack"
# Record and share terminal sessions
brew "asciinema"
# Protocol definitions and daemon for D-Bus at-spi
brew "at-spi2-core"
# Configuration editing tool and API
brew "augeas"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Shell extension to jump to frequently used directories
brew "autojump"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# GNU binary tools for native development
brew "binutils"
# Toolchain of the web
brew "biome"
# Interface bandwidth monitor
brew "bmon"
# Collection of portable C++ source libraries
brew "boost"
# Install RubyGems as Homebrew formulae
brew "brew-gem"
# Freely available high-quality data compressor
brew "bzip2"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# File format designed to store large amounts of data
brew "hdf5"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# C library for files containing sampled sound
brew "libsndfile"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Package for scientific computing with Python
brew "numpy"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Core component of the AcoustID project (Audio fingerprinting)
brew "chromaprint"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Securely send things from one computer to another
brew "croc"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# Update dynamic DNS entries
brew "ddclient"
# GNU data recovery tool
brew "ddrescue"
# Tool for exploring each layer in a docker image
brew "dive"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Text processing system for reStructuredText
brew "docutils"
# Replay stored shell commands for live presentations
brew "doitlive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Convert text to Postscript, HTML, or RTF, with syntax highlighting
brew "enscript"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Image manipulation
brew "netpbm"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Console program to recover files based on their headers and footers
brew "foremost"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU awk utility
brew "gawk"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Highly customizable changelog generator
brew "git-cliff"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Update multiple git repositories at once
brew "gitup"
# Multi-platform library for OpenGL applications
brew "glfw"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# Library for USB device access
brew "libusb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Spell checker and morphological analyzer
brew "hunspell"
# Cross-platform application and UI framework
brew "qt"
# Command-driven, interactive function plotting
brew "gnuplot"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Fast linters runner for Go
brew "golangci-lint"
# Multimedia framework for research and academic purposes
brew "gpac"
# Library access to GnuPG
brew "gpgme"
# Ping, but with a graph
brew "gping", link: false
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Image processing tools collection
brew "graphicsmagick"
# GNU triangulated surface library
brew "gts"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# Interactive parallel SSH client
brew "hss"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# ID3 tag manipulation
brew "id3lib"
# ID3 editing tool
brew "id3tool"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image loading and rendering library
brew "imlib2"
# GNU utilities for networking
brew "inetutils"
# Audio Connection Kit
brew "jack"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Development kit for the Java programming language
brew "openjdk@17"
# Style and grammar checker
brew "languagetool"
# DNS library written in C
brew "ldns"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Sophisticated file transfer program
brew "lftp"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Portable library for network traffic capture
brew "libpcap"
# Library that provides automatic proxy configuration management
brew "libproxy"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# Access large language models from the command-line
brew "llm"
# Next-gen compiler infrastructure
brew "llvm@17"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Text-based web browser
brew "lynx"
# LZMA-based compression program similar to gzip or bzip2
brew "lzip"
# Convert nroff man pages to HTML
brew "man2html"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Scalable distributed version control system
brew "mercurial"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Remote terminal application
brew "mosh"
# Embeddable Javascript interpreter
brew "mujs"
# QUIC transport protocol implementation
brew "mvfst"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# HTTP and WebDAV client library with a C interface
brew "neon"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Net top tool grouping bandwidth per process
brew "nethogs"
# HTTP/2 C Library
brew "nghttp2"
# JSON for modern C++
brew "nlohmann-json"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Python bindings for v6 of Qt
brew "pyqt"
# Port to Qt of the Scintilla editing component
brew "qscintilla2"
# Nonlinear and differential/algebraic equations solver
brew "sundials"
# High-level interpreted language for numerical computing
brew "octave"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Development kit for the Java programming language
brew "openjdk@11"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# Library to simplify the interaction with PKCS#11
brew "pkcs11-helper"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# C++ network sniffing, packet parsing and crafting framework
brew "pcapplusplus"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Single-file executable tool for creating, reading and uploading PMTiles archives
brew "pmtiles"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Seamless operability between C++11 and Python
brew "pybind11"
# Python version management
brew "pyenv"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Docker and OCI Registry Client in Go and tooling using those libraries
brew "regclient"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Standard unix software packaging tool
brew "rpm"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Software for mathematics, science, and engineering
brew "scipy"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Display and control your Android device
brew "scrcpy"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Intuitive find & replace CLI
brew "sd"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Work with remote images registries
brew "skopeo"
# Yet another network load monitor
brew "slurm"
# Scans and monitors projects for security vulnerabilities
brew "snyk-cli"
# SIP User-Agent library
brew "sofia-sip"
# Ruby language server
brew "solargraph"
# SOund eXchange: universal sound sample translator
brew "sox"
# Soak up standard input and write to a file
brew "sponge"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Version control system designed to be a better CVS
brew "subversion"
# Formatting technology for Swift source code
brew "swift-format"
# Command-line packet analyzer
brew "tcpdump"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal image and video viewer
brew "timg"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Modern reverse proxy
brew "traefik"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# MPEG Transport Stream Toolkit
brew "tsduck"
# Unidata unit conversion library
brew "udunits"
# File synchronization tool
brew "unison"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Syntax-aware linter for prose
brew "vale"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Command-line interface for Vercel
brew "vercel-cli"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Successor of GNU Wget, a file and recursive website downloader
brew "wget2"
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Command-line tool that draw plots on the terminal
brew "youplot"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# UNIX shell (command interpreter)
brew "zsh"
# OctoSQL is a query tool that allows you to join, analyse and transform data from multiple databases and file formats using SQL.
brew "cube2222/octosql/octosql"
# Lock file during command
brew "discoteq/discoteq/flock"
# Vivict++ is an easy to use tool for subjective comparison of the visual quality of different encodings of the same video source.
brew "grusell/vivictpp/vivictpp"
# Packer
brew "hashicorp/tap/packer"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Log viewer for JSON and logfmt logs
brew "pamburus/tap/hl"
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Creates an XCFramework out of a Swift Package using xcodebuild
brew "segment-integrations/formulae/swift-create-xcframework"
# Supabase CLI
brew "supabase/tap/supabase"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Tools for building Android applications
cask "android-studio"
# Multi-track audio editor and recorder
cask "audacity"
# Edit and manage bibliographies
cask "bibdesk"
# Virtual Audio Driver
cask "blackhole-2ch"
# Command-line display management utility
cask "cscreen"
# Server and cloud storage browser
cask "cyberduck"
# Virtual monitor for screen sharing
cask "deskpad"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Matrix collaboration client
cask "element"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
cask "font-glegoo"
cask "font-jetbrains-mono"
cask "font-lato"
cask "font-merriweather"
cask "font-monaspace"
cask "font-oswald"
cask "font-quicksand"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
# Horizontal and vertical rulers
cask "free-ruler"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Tool to measure the computer system's performance
cask "geekbench"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Client for the Google Drive storage service
cask "google-drive"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Open-source video transcoder
cask "handbrake-app"
# Hex editor focussing on speed
cask "hex-fiend"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Open-source screen recorder built with web technology
cask "kap"
# Personal data manager focusing on security
cask "keepassx"
# Password manager app
cask "keepassxc"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Open-source keystroke visualiser
cask "keycastr"
# Scanner app for math and science
cask "mathpix-snipping-tool"
# Minimal installer for conda
cask "miniconda"
# Online collaborative whiteboard platform
cask "miro"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
cask "octave-app"
# Image editor
cask "paintbrush"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Audiovisual analytics and filtering for video files
cask "qctools"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for JSON files
cask "quicklook-json"
# Environment for statistical computing and graphics
cask "r-app"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Official desktop client for Rocket.Chat
cask "rocket-chat"
# Data science software focusing on R and Python
cask "rstudio"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Media player based on MPlayer and mplayer2
cask "stolendata-mpv"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@8"
# Unpacks archive files
cask "the-unarchiver"
# Open-source BitTorrent client
cask "transmission"
# Free and open-source OpenVPN client
cask "tunnelblick"
# AI image upscaler
cask "upscayl"
# Gives Vagrant VMware plugin access to various VMware functionalities
cask "vagrant-vmware-utility"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Quick Look plugin for webp files
cask "webpquicklook"
# Native desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark-app"
# Open-source version of the X.Org X Window System
cask "xquartz"
cask "yemuzip"
# Video communication and virtual meeting platform
cask "zoom"
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LanScan", id: 472226235
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
vscode "asabil.meson"
vscode "bibhasdn.unique-lines"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bladnman.auto-align"
vscode "bradlc.vscode-tailwindcss"
vscode "buster.ndjson-colorizer"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "castwide.solargraph"
vscode "charliermarsh.ruff"
vscode "chouzz.vscode-better-align"
vscode "christianalexander.flip"
vscode "codeandstuff.package-json-upgrade"
vscode "coolbear.systemd-unit-file"
vscode "cschlosser.doxdocgen"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "expixel.vscode-eval"
vscode "flesler.url-encode"
vscode "foxundermoon.shell-format"
vscode "fredericbonnet.cmake-test-adapter"
vscode "fregante.ghost-text"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "guyskk.language-cython"
vscode "hbenl.vscode-test-explorer"
vscode "iliazeus.vscode-ansi"
vscode "itsdevdom.theme-deep-ocean"
vscode "james-yu.latex-workshop"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jkjustjoshing.vscode-text-pastry"
vscode "jock.svg"
vscode "koichisasada.vscode-rdbg"
vscode "konstantin.wrapselection"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "loyieking.smalise"
vscode "mads-hartmann.bash-ide-vscode"
vscode "magicstack.magicpython"
vscode "marcoms.oceanic-plus"
vscode "matangover.mypy"
vscode "mathiasfrohlich.kotlin"
vscode "mathworks.language-matlab"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "miguel-savignano.ruby-symbols"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-pg"
vscode "mtxr.sqltools-driver-sqlite"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "pustelto.bracketeer"
vscode "qcz.text-power-tools"
vscode "randomfractalsinc.duckdb-sql-tools"
vscode "rdebugger.r-debugger"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sleistner.vscode-fileutils"
vscode "sorbet.sorbet-vscode-extension"
vscode "sswg.swift-lang"
vscode "stkb.rewrap"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "surajbarkale.ninja"
vscode "swiftlang.swift-vscode"
vscode "tadayosi.vscode-makefile-outliner"
vscode "tamasfe.even-better-toml"
vscode "telesoho.vscode-markdown-paste-image"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vknabel.vscode-apple-swift-format"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wholroyd.jinja"
vscode "withfig.fig"
vscode "wmaurer.change-case"
vscode "yo1dog.cursor-align"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
