tap "discoteq/discoteq"
tap "github/gh"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "randy3k/r"
tap "saulpw/vd"
tap "slhck/moreutils"
tap "teamookla/speedtest"
tap "tsduck/tsduck"
tap "yt-dlp/taps"
# Search tool like grep, but optimized for programmers
brew "ack"
# Software library to render fonts
brew "freetype"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Perceptual video quality assessment based on multi-method fusion
brew "libvmaf"
# Configuration editing tool and API
brew "augeas"
# Shell extension to jump to frequently used directories
brew "autojump"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Google's own build tool
brew "bazel"
# Interface bandwidth monitor
brew "bmon"
# Collection of portable C++ source libraries
brew "boost"
# Freely available high-quality data compressor
brew "bzip2"
# Multimedia framework for research and academic purposes
brew "gpac"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Free, GPL licensed closed caption tool
brew "ccextractor"
# GNU compiler collection
brew "gcc"
# Optimized BLAS library
brew "openblas"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Rich and complete approach to parallelism in C++
brew "tbb"
# C++ library for large-scale optimization
brew "ceres-solver"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Utility that creates projects from templates
brew "cookiecutter"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Update dynamic DNS entries
brew "ddclient"
# GNU data recovery tool
brew "ddrescue"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Text processing system for reStructuredText
brew "docutils", link: false
# Replay stored shell commands for live presentations
brew "doitlive"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generate documentation for several programming languages
brew "doxygen"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# EXIF and IPTC metadata manipulation library and tools
brew "exiv2"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# C library for files containing sampled sound
brew "libsndfile"
# Scaling, colorspace conversion, and dithering library
brew "zimg"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Console program to recover files based on their headers and footers
brew "foremost"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# Update multiple git repositories at once
brew "gitup"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Library for USB device access
brew "libusb"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Colorize logfiles and command output
brew "grc"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# GSettings schemas for desktop components
brew "gsettings-desktop-schemas"
# GUI toolkit
brew "gtk+"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# File format designed to store large amounts of data
brew "hdf5"
# Interactive parallel SSH client
brew "hss"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# ID3 tag manipulation
brew "id3lib"
# ID3 editing tool
brew "id3tool"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image loading and rendering library
brew "imlib2"
# Audio Connection Kit
brew "jack"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Network authentication protocol
brew "krb5"
# DNS library written in C
brew "ldns"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Sophisticated file transfer program
brew "lftp"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Portable library for network traffic capture
brew "libpcap"
# Postgres C API library
brew "libpq"
# Library that provides automatic proxy configuration management
brew "libproxy"
# Convert nroff man pages to HTML
brew "man2html"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Scalable distributed version control system
brew "mercurial"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Like sed, awk, cut, join & sort for name-indexed data such as CSV
brew "miller"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Remote terminal application
brew "mosh"
# Embeddable Javascript interpreter
brew "mujs"
# Open source relational database management system
brew "mysql"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# HTTP and WebDAV client library with a C interface
brew "neon"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Net top tool grouping bandwidth per process
brew "nethogs"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Package for scientific computing with Python
brew "numpy"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# C++ network sniffing, packet parsing and crafting framework
brew "pcapplusplus"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# PNG image optimizing utility
brew "pngquant"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql"
# Parallel versions of OpenSSH and related tools
brew "pssh"
# Monitor data's progress through a pipe
brew "pv"
# Password generator
brew "pwgen"
# Seamless operability between C++11 and Python
brew "pybind11"
# Python version management
brew "pyenv"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Python bindings for v6 of Qt
brew "pyqt"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Port to Qt of the Scintilla editing component
brew "qscintilla2"
# Software environment for statistical computing
brew "r"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Software for mathematics, science, and engineering
brew "scipy"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Terminal multiplexer with VT100/ANSI terminal emulation
brew "screen"
# Library for using TrueType fonts in SDL applications
brew "sdl2_ttf"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Yet another network load monitor
brew "slurm"
# SIP User-Agent library
brew "sofia-sip"
# SOund eXchange: universal sound sample translator
brew "sox"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id", link: true
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Version control system designed to be a better CVS
brew "subversion"
# Nonlinear and differential/algebraic equations solver
brew "sundials"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal image and video viewer
brew "timg"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Unidata unit conversion library
brew "udunits"
# File synchronization tool for OSX
brew "unison"
# Video processing framework with simplicity in mind
brew "vapoursynth"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Makes XML and HTML more amenable to classic UNIX text tools
brew "xml2"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Terminal utility for exploring and arranging tabular data
brew "saulpw/vd/visidata"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# MPEG Transport Stream Toolkit
brew "tsduck/tsduck/tsduck"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Application launcher and productivity software
cask "alfred"
# Always on top window preview
cask "amitv87-pip"
# Multi-track audio editor and recorder
cask "audacity"
# Edit and manage bibliographies
cask "bibdesk"
# Command-line display management utility
cask "cscreen"
# Server and cloud storage browser
cask "cyberduck"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Matrix collaboration client
cask "element"
cask "font-glegoo"
cask "font-lato"
cask "font-merriweather"
cask "font-oswald"
cask "font-quicksand"
cask "font-source-code-pro"
cask "font-source-sans-pro"
# Horizontal and vertical rulers
cask "free-ruler"
# Tool to measure the computer system's performance
cask "geekbench"
# Client for the Google Drive storage service
cask "google-drive"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Open-source video transcoder
cask "handbrake"
# Hex editor focussing on speed
cask "hex-fiend"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Personal data manager focusing on security
cask "keepassx"
# Password manager app
cask "keepassxc"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Open-source keystroke visualizer
cask "keycastr"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Adjustable weather viewing application
cask "meteorologist"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Open-source software for live streaming and screen recording
cask "obs"
# Image editor
cask "paintbrush"
# Collaboration platform for API development
cask "postman"
cask "qctools"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "quicklook-json"
# Environment for statistical computing and graphics
cask "r"
# Screencasting software
cask "recordit"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Official desktop client for Rocket.Chat
cask "rocket-chat"
# Data science software focusing on R and Python
cask "rstudio"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "webpquicklook"
# Desktop client for WhatsApp
cask "whatsapp"
# Network protocol analyzer
cask "wireshark"
cask "yemuzip"
# Video communication and virtual meeting platform
cask "zoom"
